# Tourist Visitor Information Database for US Cities
### Data Engineering Capstone Project

#### Project Summary
US Federal body for Toursim Management(USATM) has hired my organisation Rusty's Analtics & Data Consulting(RADC) to extract, transform & load immigration and cities data to one table for their team to carry out advanced analytics. USATM has an advanced analytics team that would like to run use cases such as identifying cities with most tourist footfall and then accordingly allocate budgets for marketing/advertising spend for the upcoming tourist season. RADC is an expert in this area and would like to help them out with our expertise in the Data & Analytics area.  

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [7]:
# Do all imports and installs here
import pandas as pd

### Step 1: Scope the Project and Gather Data

#### Scope 
Explain what you plan to do in the project in more detail. What data do you use? What is your end solution look like? What tools did you use? etc>
We will be reading 2 files - immigration_data_sample.csv and us-cities-demograpgics.csv from S3. Once we have read the 2 files, we will perform Exploratory Data Analysis to review the data and file contents(using the describe function for review). We will then create fact & dimensions table from the data and perform data quality checks once the files are loaded in Redshift. These tables will be available in Redshift for the USATM team to utilise for further insights.   

#### Describe and Gather Data 
Describe the data sets you're using. Where did it come from? What type of information is included? 
I will be using the udacity provided data sets - immigration_data_sample.csv & us-cities-demographics.csv. Immigration data set contains the list of all inflow to the USA via different modes of transport for a certain period. Other CSV with US cities demographics has resident demographic information for each city in the USA.

In [11]:
# Read in the data here from S3 bucket
fname = 'immigration_data_sample.csv'
df = pd.read_csv(fname)

#Use Describe function to check basics of the data set. 
#Initial EDA Reveals: 
#Records are from Year 2016
#1000 records in the file
#Data is for the month of April
#75% arrivals are by Air
#Majority of passengers are travelling for 'Pleasure' 
#Average age of travellers is 43, Oldest passenger is 93, Youngest is 1 year old.
#df.describe()
print("First 5 rows")
df.head(5)

First 5 rows

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.000000000,2016.000000000,4.000000000,209.000000000,209.000000000,HHW,20566.000000000,1.000000000,HI,...,nan,M,1955.000000000,07202016,F,nan,JL,56582674633.000000000,00782,WT
1,2171295,4422636.000000000,2016.000000000,4.000000000,582.000000000,582.000000000,MCA,20567.000000000,1.000000000,TX,...,nan,M,1990.000000000,10222016,M,nan,*GA,94361995930.000000000,XBLNG,B2
2,589494,1195600.000000000,2016.000000000,4.000000000,148.000000000,112.000000000,OGG,20551.000000000,1.000000000,FL,...,nan,M,1940.000000000,07052016,M,nan,LH,55780468433.000000000,00464,WT
3,2631158,5291768.000000000,2016.000000000,4.000000000,297.000000000,297.000000000,LOS,20572.000000000,1.000000000,CA,...,nan,M,1991.000000000,10272016,M,nan,QR,94789696030.000000000,00739,B2
4,3032257,985523.000000000,2016.000000000,4.000000000,111.000000000,111.000000000,CHM,20550.000000000,3.000000000,NY,...,nan,M,1997.000000000,07042016,F,nan,NaN,42322572633.000000000,LAND,WT

In [12]:
print("Print information, shape, and data type for the data frame")
df.info()

Print information, shape, and data type for the data frame
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 29 columns):
Unnamed: 0    1000 non-null int64
cicid         1000 non-null float64
i94yr         1000 non-null float64
i94mon        1000 non-null float64
i94cit        1000 non-null float64
i94res        1000 non-null float64
i94port       1000 non-null object
arrdate       1000 non-null float64
i94mode       1000 non-null float64
i94addr       941 non-null object
depdate       951 non-null float64
i94bir        1000 non-null float64
i94visa       1000 non-null float64
count         1000 non-null float64
dtadfile      1000 non-null int64
visapost      382 non-null object
occup         4 non-null object
entdepa       1000 non-null object
entdepd       954 non-null object
entdepu       0 non-null float64
matflag       954 non-null object
biryear       1000 non-null float64
dtaddto       1000 non-null object
gender        859 non-null object
insnum        35 non-null float64
airline       967 non-null object
admnum        1000 non-null float64
fltno         992 non-null object
visatype      1000 non-null object
dtypes: float64(15), int64(2), object(12)
memory usage: 226.6+ KB

In [28]:
#Read file from a S3 Bucket
fname = 'us-cities-demographics.csv'
df1 = pd.read_csv(fname, delimiter=';')

#Use this function to convert data with scientific notation to float
pd.set_option('display.float_format', lambda x: '%.9f' % x)

#Use Describe function to check basics of the data set but first.
#Initial EDA Reveals: 
#Total records is 2891
#Average age of regidents in the file is 35
#Max male population is 4.08 million
#Max female population is 4.5 million
#Total population is 8.56 million
#On average there are 9370 veterans across US cities
#Across cities in the US - 40,653 residents are foreign-born
df1.describe()
#df1.head()

,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,Count
count,2891.000000000,2888.000000000,2888.000000000,2891.000000000,2878.000000000,2878.000000000,2875.000000000,2891.000000000
mean,35.494880664,97328.426246537,101769.630886427,198966.779315116,9367.832522585,40653.598679639,2.742542609,48963.774472501
std,4.401616730,216299.936928733,231564.572571483,447555.929633590,13211.219923864,155749.103665098,0.433291088,144385.588564606
min,22.900000000,29281.000000000,27348.000000000,63215.000000000,416.000000000,861.000000000,2.000000000,98.000000000
25%,32.800000000,39289.000000000,41227.000000000,80429.000000000,3739.000000000,9224.000000000,2.430000000,3435.000000000
50%,35.300000000,52341.000000000,53809.000000000,106782.000000000,5397.000000000,18822.000000000,2.650000000,13780.000000000
75%,38.000000000,86641.750000000,89604.000000000,175232.000000000,9368.000000000,33971.750000000,2.950000000,54447.000000000
max,70.500000000,4081698.000000000,4468707.000000000,8550405.000000000,156961.000000000,3212500.000000000,4.980000000,3835726.000000000

In [13]:
print("Print information, shape, and data type for the data frame")
df1.info()

Print information, shape, and data type for the data frame
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2891 entries, 0 to 2890
Data columns (total 12 columns):
City                      2891 non-null object
State                     2891 non-null object
Median Age                2891 non-null float64
Male Population           2888 non-null float64
Female Population         2888 non-null float64
Total Population          2891 non-null int64
Number of Veterans        2878 non-null float64
Foreign-born              2878 non-null float64
Average Household Size    2875 non-null float64
State Code                2891 non-null object
Race                      2891 non-null object
Count                     2891 non-null int64
dtypes: float64(6), int64(2), object(4)
memory usage: 271.1+ KB

In [19]:
#from pyspark.sql import SparkSession
#spark = SparkSession.builder.\
#config("spark.jars.packages","saurfang:spark-sas7bdat:2.0.0-s_2.11,org.apache.hadoop:hadoop-aws:2.7.2")\
#.enableHiveSupport().getOrCreate()

In [20]:
#df_spark =spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')

In [32]:
#df_filter = df_spark[(df_spark.visatype)=='B1']
#df_filter.head()
#Check distinct visa types to check if there are any nulls as this would be used to draw metrics on immigrant type
#df_spark.select('visatype').distinct().show()
#print("LUND")

In [ ]:
#df_spark.select('State Code').distinct().show()

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

In [16]:
#Count unique values in immigration dataframe
df.nunique()

Unnamed: 0       0
cicid            0
i94yr            0
i94mon           0
i94cit           0
i94res           0
i94port          0
arrdate          0
i94mode          0
i94addr         59
depdate         49
i94bir           0
i94visa          0
count            0
dtadfile         0
visapost       618
occup          996
entdepa          0
entdepd         46
entdepu       1000
matflag         46
biryear          0
dtaddto          0
gender         141
insnum         965
airline         33
admnum           0
fltno            8
visatype         0
dtype: int64

In [17]:
# Checking if any rows in the immigration data frame have missing data
df.isnull().sum()

Unnamed: 0       0
cicid            0
i94yr            0
i94mon           0
i94cit           0
i94res           0
i94port          0
arrdate          0
i94mode          0
i94addr         59
depdate         49
i94bir           0
i94visa          0
count            0
dtadfile         0
visapost       618
occup          996
entdepa          0
entdepd         46
entdepu       1000
matflag         46
biryear          0
dtaddto          0
gender         141
insnum         965
airline         33
admnum           0
fltno            8
visatype         0
dtype: int64

In [25]:
# Fill NaN with a blank space
df['i94addr'] = df['i94addr'].fillna(' ')
df['depdate'] = df['depdate'].fillna(' ')
df['visapost'] = df['visapost'].fillna(' ')
df['occup'] = df['occup'].fillna(' ')
df['gender'] = df['gender'].fillna(' ')
df['airline'] = df['airline'].fillna(' ')
df.isnull().sum()

Unnamed: 0       0
cicid            0
i94yr            0
i94mon           0
i94cit           0
i94res           0
i94port          0
arrdate          0
i94mode          0
i94addr          0
depdate          0
i94bir           0
i94visa          0
count            0
dtadfile         0
visapost         0
occup            0
entdepa          0
entdepd         46
entdepu       1000
matflag         46
biryear          0
dtaddto          0
gender           0
insnum         965
airline          0
admnum           0
fltno            8
visatype         0
dtype: int64

In [21]:
#Check for duplicated data
bool_series = df.duplicated()
print(bool_series)

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
970    False
971    False
972    False
973    False
974    False
975    False
976    False
977    False
978    False
979    False
980    False
981    False
982    False
983    False
984    False
985    False
986    False
987    False
988    False
989    False
990    False
991    False
992    False
993    False
994    False
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [15]:
#Count unique values in US Cities dataframe
df1.nunique()

City                       567
State                       49
Median Age                 180
Male Population            593
Female Population          594
Total Population           594
Number of Veterans         577
Foreign-born               587
Average Household Size     161
State Code                  49
Race                         5
Count                     2785
dtype: int64

In [26]:
# Checking if any rows in the us cities demographics data frame have missing data
df1.isnull().sum()

City                       0
State                      0
Median Age                 0
Male Population            3
Female Population          3
Total Population           0
Number of Veterans        13
Foreign-born              13
Average Household Size    16
State Code                 0
Race                       0
Count                      0
dtype: int64

In [31]:
# Fill NaN with a mean value
df1['Male Population'] = df1['Male Population'].fillna(df1['Male Population'].mean())
df1['Female Population'] = df1['Female Population'].fillna(df1['Female Population'].mean())
df1['Number of Veterans'] = df1['Number of Veterans'].fillna(df1['Number of Veterans'].mean())
df1['Average Household Size'] = df1['Average Household Size'].fillna(df1['Average Household Size'].mean())
df1['Foreign-born'] = df1['Foreign-born'].fillna(df1['Foreign-born'].mean())
df1.isnull().sum()

City                      0
State                     0
Median Age                0
Male Population           0
Female Population         0
Total Population          0
Number of Veterans        0
Foreign-born              0
Average Household Size    0
State Code                0
Race                      0
Count                     0
dtype: int64

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [ ]:
# Write code here

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

In [ ]:
# Perform quality checks here

#### 4.3 Data dictionary 
Create a data dictionary for your data model. For each field, provide a brief description of what the data is and where it came from. You can include the data dictionary in the notebook or in a separate file.

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.